{"galleries":{"homeCarousel":[{"image":"Shop2.jpg"},{"image":"19760306_s.jpg"},{"image":"21046611_ml.jpg"},{"image":"o[5].jpg"},{"image":"20160910_092207_resized.jpg"},{"image":"o[1].jpg"},{"image":"20160907_142407_resized.jpg"},{"image":"57105514_s.jpg"},{"image":"37035680_s.jpg"}],"sweetPies":[{"title":"Texas Pecan Pie","description":"The unique flavor in our pecan pie comes from wholesome Texas pecans and the right amount of dark molasses!","price":"$4.99 Slice $24.99 Whole","image":"22801938_s.jpg"},{"title":"Choc-ful of Chocolate Pie","description":"You haven't had chocolate pie until you've had our rich bittersweet chocolate pie!","price":"$4.99 Slice $24.99 Whole","image":"34156213_s.jpg"},{"title":"Island Coconut Cream Pie","description":"Toasted shredded coconut yield the right flavor and crispiness to this pie made with real coconut milk!","price":"$4.99 Slice $24.99 Whole","image":"20160816_140504(0)-2.jpg"},{"title":"The Queen's Lemon Chess","description":"The perfect amount of citrus lemon flavor enhances this rich buttermilk chess pie!","price":"$4.99 Slice $24.99 Whole","image":"20160903_083144_resized.jpg"}],"savoryPies":[{"image":"Chicken_Pot_Pie.jpg","title":"Chicken Pot Pie","description":"Tasty shredded chicken and diced vegetables in a thickened, savory broth baked in a flaky, buttery pie crust.","price":"$6.75/serving"},{"title":"Italian Sausage Meat Pie","price":"$6.75/serving","description":"Savory Italian sausage, mozzarella cheese, tomatoes, basil, onion and garlic baked in a flaky rosemary crust.","image":"Italian_Sausage_Meat_Pie.jpg"},{"title":"Spinach Mushroom Quiche","price":"$6.75 /Slice","description":"Fresh leaf spinach, mushrooms, green olives, feta and cheddar cheeses baked in a rich milk and egg filling","image":"Spinach_Mushroom_Quiche.jpg"},{"title":"Italian Sausage Pie","description":"Savory Italian sausage, mozzarella cheese, tomatoes, basil, onion and garlic baked in a flaky rosemary crust","price":"$6.75 Slice","image":"37035680_s.jpg"},{"title":"Quiche Lorraine","description":"Crisp bacon crumbled with green onion, feta and cheddar cheeses baked in a rich milk and egg filling","price":"$6.75 Slice $28.99 Whole","image":"42252370_s.jpg"}]},"text":{"thePieShop":{"paragraphs":["Beth’s Artisan Pies is a bakery and café specializing in homemade, handmade pies.  We invite you to drop in to treat yourself to a slice of pie and enjoy a rich cup of coffee; or come for lunch and experience a portion of savory pie and a side, including your choice of garden salad, chicken salad, or hot soup.  Saturday mornings include early hours for brunch.  And of course, a select menu of whole dessert and savory pies are available on hand, or by special order for carry out."]},"aboutBeth":{"paragraphs":["Beth first learned the art of making fruit pies and cobblers alongside her mother and sister when she was nine years old.  Her family lived on acreage with an abundance of fruit trees and berry vines.  To preserve the bountiful harvest, Beth and her female relatives processed the fruit into baked goods, jams and jellies, and canned and frozen slices.  But making pies was always Beth’s favorite.  The process of mixing and rolling out the dough, filling it with slightly sweetened seasonal fruits and baking a pie, ready for dinner or a potluck that night, intrigued and satisfied Beth. Many a summer Sunday evening was spent with relatives who brought their best creation to a pie supper.  ","The inspiration for a pie shop was born out of the summer vacations Beth spent with her grandparents in central rural Missouri.  As they drove through small towns, they frequently pulled up to diners to get out and stretch their legs.  Granny usually ordered “just pie and coffee” but made sure Beth had a healthy sandwich and milk. At that young age, Beth was anxious to be able to order her own pie and coffee someday. So today Beth wants to recreate that experience for her friends and neighbors in Carrollton, providing a place to eat pie and drink coffee in the company of friends.","So stop in and sample Beth’s Artisan Pies – the Pie’s the limit!",""],"image":"Beth_with_Pies.jpg"},"thePies":{"paragraphs":["What sets Beth’s Artisan Pies apart from other restaurant pies is the crust.  Each crust is individually mixed and rolled to create a light, flaky texture and buttery flavor.  ","All pies are handmade using fresh and scratch ingredients to preserve an authentic artisan style, so no two pies will ever look exactly alike, although they will always have the unique flavor and texture that is expected of Beth’s homemade, handmade products.",""]},"orderOnline":{"paragraphs":["A phone call is the best option for orders to-go. After store hours, please list items in the message box below, and\nprovide your name and phone number so that we can confirm your order and pickup time.\nThe store will be opened for pickup orders until 6:30pm on weekdays and 2:30pm on Saturdays.","(Allow 24 hrs for whole pie orders)"]}},"menu":{"lunch":[{"title":"Lunch Combo","description":"Serving of Savory pie with a side salad or cup of soup. \nPIE Options: Spinach Mushroom Quiche, Italian Sausage Pie, Chicken Pot Pie.","price":"$9.79"},{"title":"Make It a Triple","description":"Combo of chicken salad, side salad and cup of soup.","price":"$8.79"},{"description":"Green leaf lettuce, fresh spinach, red cabbage, tomatoes, carrots, black olives, red onion, feta cheese. \nAdd chicken salad: $2.25","title":"Dinner Salad","price":"$5.25"}],"brunch":[{"title":"Brunch Pie Combo","description":"Slice of pie with a side of skillet potatoes.\nPIE choices below:","price":"Combo $8.75"},{"description":"Fresh leaf spinach, mushrooms, green olives, feta and cheddar cheeses baked in a rich milk and egg filling","title":"Spinach Mushroom Quiche","price":"$5.75/Slice"},{"title":"Quiche Lorraine","description":"Crisp bacon crumbled with green onion, feta and cheddar cheeses baked in a rich milk and egg filling.","price":"$5.75/Slice"},{"title":"Rise and Shine Breakfast Pie","description":"Creamy yogurt filling topped with fresh oranges and berries.","price":"$5.75/Slice"},{"title":"French Toast Casserole","description":"All the yummy goodness of French toast baked in a butter and brown sugar syrup","price":"$5.75/Serving"},{"title":"Skillet Potatoes w/Sausage link","description":"Skillet Potatoes with Sausage link or egg.","price":"$5.25"}],"sides":[{"title":"Chicken Noodle Soup","description":"Homemade soup with chunks of chicken, noodles, carrots, celery, and onion cooked in savory chicken broth.","price":"Cup $3.25/Bowl $5.25"},{"description":"Slow-cooked red potatoes, carrots, onions and vegetable broth developed by our own Chef Wright. Vegan, vegetarian and gluten-free.","title":"Wright Choice Potato Soup","price":"Cup $3.25/Bowl $5.25"},{"title":"Side Salad","description":"Crisp green leaf lettuce, baby spinach, red cabbage, carrots, red onion, grape tomatoes, black olives and feta cheese.","price":"$3.25"},{"title":"Chicken Salad","description":"Tender chicken breast, oven-roasted with herbs, then combined with red onion, dried cranberries and seasoned mayonnaise dressing.","price":"$3.25"}],"specialOrders":[]},"contact":{"phone":"(469) 892-6339","address":["2540 N Josey Ln #112","Carrollton, TX"],"hours":["Monday - Friday 10AM - 6PM","Saturday 8AM - 2PM"],"email":"order4pies@gmail.com"}}